Junior Year/January 2019/Assignment 5/Task 11/TUT6/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
110516
(
(0.776332 2.04337e-005 -0.221166)
(0.826307 -4.08652e-006 -0.148648)
(0.879457 4.81764e-006 -0.0770321)
(0.936382 4.28028e-007 -0.0276734)
(0.971174 -2.62636e-006 -0.0118761)
(0.987092 -1.76365e-006 -0.00534175)
(0.994262 -7.24916e-007 -0.00239544)
(0.997466 -3.85451e-007 -0.00106798)
...
)
;

boundaryField
{
    pipe_superfine_walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    pipe_superfine_outlet
    {
        type            outletInlet;
        outletValue     uniform (1 0 0);
        value           uniform (1 0 0);
    }
    pipe_superfine_inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
}


// ************************************************************************* //
